 SQL
===

SQL is a language for getting data from databases. It is also becoming essential to have some basic familiarity with SQL because it is universally used to slice and dice data across many different data storage formats and technologies.

SQL via `pandas` DataFrames
----

In [38]:
! pip install pandasql &> /dev/null

In [10]:
from pandasql import PandaSQL
pdsql = PandaSQL()

In [9]:
tips = sns.load_dataset('tips')
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

### Simple queries

In [14]:
pdsql("select * from tips limit 5;")

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [15]:
pdsql("select * from tips where sex='Female' limit 5")

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       24.59  3.61  Female     No  Sun  Dinner     4
2       35.26  5.00  Female     No  Sun  Dinner     4
3       14.83  3.02  Female     No  Sun  Dinner     2
4       10.33  1.67  Female     No  Sun  Dinner     3

In [19]:
pdsql("select tip, sex, size from tips where total_bill< 10 limit 5;")

    tip     sex  size
0  2.00    Male     2
1  1.45    Male     2
2  1.32    Male     2
3  1.56    Male     2
4  1.00  Female     1

### Ordering

In [23]:
query = """
select * from tips
where sex='Female' and smoker='Yes'
order by total_bill ASC
limit 5;
"""
pdsql(query)

   total_bill   tip     sex smoker  day    time  size
0        3.07  1.00  Female    Yes  Sat  Dinner     1
1        5.75  1.00  Female    Yes  Fri  Dinner     2
2        9.60  4.00  Female    Yes  Sun  Dinner     2
3       10.09  2.00  Female    Yes  Fri   Lunch     2
4       10.59  1.61  Female    Yes  Sat  Dinner     2

### Aggregate queries

In [48]:
query = """
select count(*) as count, max(tip) as max, min(tip) as min from tips
where size > 1
group by sex, day
having max < 6
order by count DESC
limit 5;
"""
pdsql(query)

   count   max   min
0     31  5.17  1.25
1     18  5.20  1.01
2      9  4.30  1.00
3      9  4.73  1.50

### Using SQLite3

In [55]:
import sqlite3

In [56]:
conn = sqlite3.connect('../data/Chinook_Sqlite.sqlite')

In [ ]:
conn.execute